<?php
// +----------------------------------------------------------------------
// | Sitemap [ WE CAN DO IT MORE SIMPLE ]
// +----------------------------------------------------------------------
// | Copyright (c) 2020-2021 HUANGCHENG All rights reserved.
// +----------------------------------------------------------------------
// | Author: HUANGCHENG <271301671@qq.com>
// +----------------------------------------------------------------------
return [
    'site'          => [
        'title' => '网址',
        'type'  => 'text',
        'value' => '',
        'tip'   => '推送网址',
    ],
    'token'          => [
        'title' => '百度token',
        'type'  => 'text',
        'value' => '',
        'tip'   => '百度token如需使用实时推送此项必填',
    ],
    'ispush'=>[
        'title' => '实时推送',
        'type'  => 'radio',
        'options' => [
            '1' => '开启',
            '0' => '关闭'
        ],
        'value'   => '0',
        'tip'   => '开启后发布文章自动推送到百度(开启此功能后必须填写token)',
    ]
];
